tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "martido/brew-graph"
cask "osxfuse"
# SSL/TLS cryptography library
brew "openssl"
# Download with resuming and segmented downloading
brew "aria2"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Collection of portable C++ source libraries
brew "boost"
# C++ build system
brew "boost-build"
# Encrypted pass-through FUSE file system
brew "encfs"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Source code tag system
brew "global"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Mac App Store command-line interface
brew "mas"
# Multiple Repository management tool
brew "mr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Version control system designed to be a better CVS
brew "subversion"
# Feature-rich console based todo list manager
brew "task"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ncurses based file manager with vi like keybindings
brew "vifm"
# Internet file retriever
brew "wget"
brew "martido/brew-graph/brew-graph"
cask "alfred"
cask "android-file-transfer"
cask "applepi-baker"
cask "asciidocfx"
cask "cheatsheet"
cask "dash"
cask "disk-inventory-x"
cask "docker"
cask "double-commander"
cask "fliqlo"
cask "font-dejavusansmono-nerd-font"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-hack-nerd-font"
cask "font-meslo-nerd-font"
cask "gpg-suite"
cask "iina"
cask "karabiner-elements"
cask "keepassxc"
cask "licecap"
cask "lyricsx"
cask "macdown"
cask "openoffice"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlmobi"
cask "qlstephen"
cask "qlvideo"
cask "qq"
cask "quicklook-json"
cask "quicklookase"
cask "shadowsocksx-ng"
cask "spotify"
cask "squirrel"
cask "standard-notes"
cask "suspicious-package"
cask "taskwarrior-pomodoro"
cask "touchswitcher"
cask "turtl"
cask "typora"
cask "vanilla"
cask "vimr"
cask "visual-studio-code"
cask "webpquicklook"
cask "xquartz"
cask "yu-writer"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "NeteaseMusic", id: 944848654
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pendo", id: 1220959405
mas "PixelScheduler", id: 976996075
mas "QQMusic", id: 595615424
mas "Reeder", id: 880001334
mas "Snip", id: 512505421
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
mas "爱奇艺", id: 1012296988
