tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts", "https://mirrors.cloud.tencent.com/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "knqyf263/pet"
tap "martido/graph"
tap "smlsharp/smlsharp", "https://www.pllab.riec.tohoku.ac.jp/smlsharp/download/homebrew"
tap "universal-ctags/universal-ctags"
brew "ansifilter"
brew "aria2"
brew "bash"
brew "boost"
brew "boost-build"
brew "readline"
brew "xz"
brew "python@3.9"
brew "boost-python3"
brew "chezscheme"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "datamash"
brew "dialog"
brew "dive"
brew "dos2unix"
brew "encfs"
brew "fd"
brew "guile"
brew "tesseract"
brew "ffmpeg"
brew "fluid-synth"
brew "fzf"
brew "git"
brew "git-extras"
brew "global"
brew "go"
brew "graphviz"
brew "haskell-stack"
brew "httpie"
brew "imagemagick"
brew "iproute2mac"
brew "jq"
brew "kaitai-struct-compiler"
brew "lftp"
brew "libksba"
brew "libyaml"
brew "luarocks"
brew "mas"
brew "mit-scheme"
brew "mlton"
brew "mr"
brew "neovim"
brew "node"
brew "nrg2iso"
brew "openvpn"
brew "p7zip"
brew "pandoc"
brew "pdftilecut"
brew "peco"
brew "plantuml"
brew "proxychains-ng"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylint"
brew "rename"
brew "rfcstrip"
brew "ripgrep"
brew "rpm2cpio"
brew "rust"
brew "subversion"
brew "tesseract-lang"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "timidity"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "unar"
brew "v2ray"
brew "vifm"
brew "wget"
brew "yarn"
brew "you-get"
brew "youtube-dl"
brew "zlib"
brew "knqyf263/pet/pet"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anki"
cask "appcleaner"
cask "applepi-baker"
cask "calibre"
cask "cheatsheet"
cask "dingtalk"
cask "docker"
cask "firefox"
cask "fliqlo"
cask "font-dejavusansmono-nerd-font"
cask "frescobaldi"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "keepassxc"
cask "keyfinder"
cask "kindle-previewer"
cask "kindlegen"
cask "landrop"
cask "licecap"
cask "lyricsx"
cask "mcgimp"
cask "numi"
cask "ocenaudio"
cask "osxfuse"
cask "pock"
cask "polycom-realpresence"
cask "pomotodo"
cask "qlmarkdown"
cask "qlmobi"
cask "qlvideo"
cask "qq"
cask "quicklook-json"
cask "quicklookase"
cask "racket"
cask "shadowsocksx-ng"
cask "smlnj"
cask "spotify"
cask "squirrel"
cask "suspicious-package"
cask "taskwarrior-pomodoro"
cask "tunnelblick"
cask "typora"
cask "v2rayu"
cask "visual-studio-code"
cask "vmpk"
cask "webpquicklook"
cask "wireshark"
cask "xquartz"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Capo", id: 696977615
mas "Cleaner One", id: 1133028347
mas "Color Picker Plus", id: 1499052260
mas "Disk Cartography", id: 905264208
mas "EarMaster 7", id: 1492991594
mas "Gapplin", id: 768053424
mas "Hidden Bar", id: 1452453066
mas "iMovie 剪辑", id: 408981434
mas "Kindle", id: 405399194
mas "Microsoft To Do", id: 1274495053
mas "OneDrive", id: 823766827
mas "Pine Player", id: 1112075769
mas "QQ音乐", id: 595615424
mas "Reeder", id: 880001334
mas "Snip", id: 512505421
mas "The Unarchiver", id: 425424353
mas "VOX", id: 461369673
mas "华为手机助手", id: 1232508288
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "爱奇艺", id: 1012296988
mas "网易云音乐", id: 944848654
mas "腾讯视频", id: 1231336508
